<a href="https://colab.research.google.com/github/philsaurabh/Tutorials/blob/main/Pandas_Tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

It is a Python library used for working with data sets. It has functions for analyzing, cleaning, exploring, and manipulating data.

The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

# Uses

It allows us to analyze big data and make conclusions based on statistical theories. It can clean messy data sets, and make them readable and relevant.

Pandas can give you answers about the data.
* Is there a correlation between two or more columns?
* Average, Max or Min value?
* Pandas are also able to delete rows that are not relevant, or contains wrong values, like empty or NULL values.

# Installing libraries
Just type 
```
!pip install pandas
```
and press enter to install library if not available in your workspace.

# Importing Libraries

In [4]:
import pandas as pd

# Dataframe
A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [5]:
# To read data as dataframe
df = pd.read_csv('https://raw.githubusercontent.com/philsaurabh/Tutorials/main/Advertising.csv')
# df = pd.read_csv('Advertising.csv', index_col ="TV" ) # For custom index column
#print(df)

#  Task 1: Understanding the dataset

  *   Show the values(.head, .tail)
  *   Column names(.columns)
  *   Shape of data (.shape)
  *   Informtion about data (.info)
  *   Statistical description (.describe)
  *   Check Missing (.isNull)

In [6]:
df.head()# By default, shows first 5 rows of data
#df.tail()# By default, shows last 5 rows of data

   Unnamed: 0     TV  radio  newspaper  sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

In [7]:
df.columns

Index(['Unnamed: 0', 'TV', 'radio', 'newspaper', 'sales'], dtype='object')

In [8]:
df.shape

(200, 5)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  200 non-null    int64
 1   TV          200 non-null    float64
 2   radio       200 non-null    float64
 3   newspaper   200 non-null    float64
 4   sales       200 non-null    float64
dtypes: float64(4), int64(1)
memory usage: 7.9 KB

In [10]:
df.describe()
# df.describe().T # For transpose view of the same

       Unnamed: 0          TV       radio   newspaper       sales
count  200.000000  200.000000  200.000000  200.000000  200.000000
mean   100.500000  147.042500   23.264000   30.554000   14.022500
std     57.879185   85.854236   14.846809   21.778621    5.217457
min      1.000000    0.700000    0.000000    0.300000    1.600000
25%     50.750000   74.375000    9.975000   12.750000   10.375000
50%    100.500000  149.750000   22.900000   25.750000   12.900000
75%    150.250000  218.825000   36.525000   45.100000   17.400000
max    200.000000  296.400000   49.600000  114.000000   27.000000

In [11]:
df.isnull().values.any() # If any value is missing
df.isnull().sum() # Total missing values

Unnamed: 0    0
TV            0
radio         0
newspaper     0
sales         0
dtype: int64

# Task 2: Drop a row/column

In [12]:
df.drop([198,199], inplace =True) # rows with index labeled as 198 and 199 will be dropped
df.shape

(198, 5)

In [13]:
drop_list = ["Unnamed: 0"]
df = df.drop(drop_list, axis=1)
df.columns # Unnamed column will be dropped

Index(['TV', 'radio', 'newspaper', 'sales'], dtype='object')

In [14]:
df.drop(df.columns[[0, 2]], axis = 1, inplace = True)
df.columns

Index(['radio', 'sales'], dtype='object')

# Reloding the dataset

In [15]:
df = pd.read_csv('Advertising.csv')
print(df.head())

   Unnamed: 0     TV  radio  newspaper  sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

# Task4: View Selected columns

In [16]:
data = df[['TV', 'radio']]
data

        TV  radio
0    230.1   37.8
1     44.5   39.3
2     17.2   45.9
3    151.5   41.3
4    180.8   10.8
..     ...    ...
195   38.2    3.7
196   94.2    4.9
197  177.0    9.3
198  283.6   42.0
199  232.1    8.6

[200 rows x 2 columns]

# Task 5: Sort by a given column order

In [17]:
df.sort_values(['radio', 'TV'], ascending = False)# Set ascending true or false to get different order

     Unnamed: 0     TV  radio  newspaper  sales
58           59  210.8   49.6       37.7   23.8
55           56  198.9   49.4       60.0   23.7
37           38   74.7   49.4       45.7   14.7
147         148  243.2   49.0       44.3   25.4
128         129  220.3   49.0        3.2   24.7
..          ...    ...    ...        ...    ...
157         158  149.8    1.3       24.3   10.1
117         118   76.4    0.8       14.8    9.4
108         109   13.1    0.4       25.6    5.3
107         108   90.4    0.3       23.2    8.7
127         128   80.2    0.0        9.2    8.8

[200 rows x 5 columns]

# Task 6: Filter radios with price >=49

In [18]:
df[df.radio >= 49]# Can also use >,<, <=,==

     Unnamed: 0     TV  radio  newspaper  sales
37           38   74.7   49.4       45.7   14.7
55           56  198.9   49.4       60.0   23.7
58           59  210.8   49.6       37.7   23.8
128         129  220.3   49.0        3.2   24.7
147         148  243.2   49.0       44.3   25.4

# Task 7: Filter TVs in price range 239 to 248 
There are many methods. Some are as follows.

In [19]:
df[df['TV'].between(239,248)]

     Unnamed: 0     TV  radio  newspaper  sales
27           28  240.1   16.7       22.9   15.9
47           48  239.9   41.5       18.5   23.2
62           63  239.3   15.5       27.3   15.7
81           82  239.8    4.1       36.9   12.3
111         112  241.7   38.0       23.2   21.8
146         147  240.1    7.3        8.7   13.2
147         148  243.2   49.0       44.3   25.4

In [20]:
df.query('239 <= TV <= 248')

     Unnamed: 0     TV  radio  newspaper  sales
27           28  240.1   16.7       22.9   15.9
47           48  239.9   41.5       18.5   23.2
62           63  239.3   15.5       27.3   15.7
81           82  239.8    4.1       36.9   12.3
111         112  241.7   38.0       23.2   21.8
146         147  240.1    7.3        8.7   13.2
147         148  243.2   49.0       44.3   25.4

In [21]:
df[(df['TV'] >= 239) & (df['TV'] <= 248)]

     Unnamed: 0     TV  radio  newspaper  sales
27           28  240.1   16.7       22.9   15.9
47           48  239.9   41.5       18.5   23.2
62           63  239.3   15.5       27.3   15.7
81           82  239.8    4.1       36.9   12.3
111         112  241.7   38.0       23.2   21.8
146         147  240.1    7.3        8.7   13.2
147         148  243.2   49.0       44.3   25.4

# Task 8: Select the first 3 columns from the dataset

In [22]:
df.iloc[: , 0:3]

     Unnamed: 0     TV  radio
0             1  230.1   37.8
1             2   44.5   39.3
2             3   17.2   45.9
3             4  151.5   41.3
4             5  180.8   10.8
..          ...    ...    ...
195         196   38.2    3.7
196         197   94.2    4.9
197         198  177.0    9.3
198         199  283.6   42.0
199         200  232.1    8.6

[200 rows x 3 columns]

# Task 9: Select all columns except the last 3

In [23]:
# use negative to exclude the last 3 columns
df.iloc[: , :-3]

     Unnamed: 0     TV
0             1  230.1
1             2   44.5
2             3   17.2
3             4  151.5
4             5  180.8
..          ...    ...
195         196   38.2
196         197   94.2
197         198  177.0
198         199  283.6
199         200  232.1

[200 rows x 2 columns]

# Task 10: Select the first 3 rows from the dataset

In [24]:
df.iloc[0:3 , :]

   Unnamed: 0     TV  radio  newspaper  sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3

# Task 11: Select the all rows from the dataset except last 3

In [25]:
df.iloc[:-3 , :]

     Unnamed: 0     TV  radio  newspaper  sales
0             1  230.1   37.8       69.2   22.1
1             2   44.5   39.3       45.1   10.4
2             3   17.2   45.9       69.3    9.3
3             4  151.5   41.3       58.5   18.5
4             5  180.8   10.8       58.4   12.9
..          ...    ...    ...        ...    ...
192         193   17.2    4.1       31.6    5.9
193         194  166.8   42.0        3.6   19.6
194         195  149.7   35.6        6.0   17.3
195         196   38.2    3.7       13.8    7.6
196         197   94.2    4.9        8.1    9.7

[197 rows x 5 columns]

# Additional: Operations on columns

In [27]:
df.sum(axis=0)#axis 1 for rows

0      360.2
1      141.3
2      144.7
3      273.8
4      267.9
       ...
195    259.3
196    313.9
197    403.5
198    616.3
199    462.8
Length: 200, dtype: float64

In [28]:
df['TV'].sum()

29408.5

In [29]:
df.TV.mean()

147.0425

In [30]:
df.TV.median()

149.75

In [31]:
df.TV.mode()

0     17.2
1     76.4
2    109.8
3    177.0
4    184.9
5    197.6
6    199.8
7    222.4
8    237.4
9    240.1
dtype: float64

In [40]:
df['TV'].corr(df['radio'], method='kendall')# method pearson, spearman

0.04120237262928729